# Cross-platform Homebrew packages (macOS + Linuxbrew)
# Install: brew bundle --file=shared/Brewfile

tap "homebrew/bundle"

# Shell & prompt
brew "zsh"
brew "zoxide"
brew "atuin"
brew "fzf"
brew "fd"
brew "ripgrep"
brew "eza"
brew "bat"
brew "gh"
brew "lazygit"
brew "pass"
brew "bubblewrap"
brew "node"
brew "tmux"
brew "git-delta"
